SCHOOL_MISSION = '''
🎯 Миссия школы:
Zamanui bılım dağdylaryn meñgergen ziatker, adamgerşılıgı mol, salauatty älem azamatyn tärbieleu'''

SCHOOL_VALUES = '''
🧩 Ценности школы:
1) Открытость
2) Уважение
3) Сотрудничество
4) Академическая честность
5) Ответственность
6) Функциональная грамотность
7) Обучение на протяжении всей жизни
8) Патриотизм
9) Глобальное гражданство'''


UNI_ADMISSION_STR = '''
    Поступление в вузы – это процесс, который требует серьезной подготовки и планирования. Во-первых, необходимо выбрать желаемый вуз и специальность, учитывая свои интересы, возможности и перспективы трудоустройства. Затем следует ознакомиться с требованиями поступления, сдать вступительные экзамены или тесты, подготовить документы.

Для успешного поступления также важно иметь хороший аттестат о среднем образовании и достойный уровень знаний. Подготовка к поступлению может включать изучение учебных материалов, посещение подготовительных курсов, общение с преподавателями и студентами вуза.

Важно учитывать, что поступление в вуз не гарантирует автоматического успеха в будущей профессиональной деятельности. Для достижения успеха необходимо усердно учиться, оттачивать свои навыки, осваивать новые знания и навыки, стремиться к самосовершенствованию.
'''

IELTS_ABOUT_STR = '''
    Кому нужно сдавать IELTS?

Сегодня результаты IELTS принимаются более чем 9,000 университетов в 135 странах мира, среди которых – США, Канада, Великобритания, Гонконг, Германия, Малайзия, Австралия и многие другие.
    '''
    
IELTS_STRUCTURE_STR = '''
    Языковой экзамен IELTS представлен в двух видах:
1) Academic (академический экзамен)
2) General Training (общий экзамен)

Структура IELTS:
Экзамен IELTS состоит из четырех частей:
1) Аудирование (Listening)
2) Чтение (Reading)
3) Письмо (Writing)
4) Говорение (Speaking)'''

IELTS_TIPS_STR = '''
Несколько советов для самостоятельной подготовки к IELTS:

Смотрите ТВ на английском языке
Также полезно слушать подкасты и песни на английском. Это поможет вам научиться воспринимать англоязычную речь на слух.

Говорите как можно больше
Общение с иностранными друзьями, особенно с носителями английского, максимально разовьет ваши навыки устной речи и аудирования.

Читайте книги, газеты и журналы
Постоянное чтение на английском языке научит вас быстро воспринимать и анализировать англоязычные тексты на разные темы. Вы можете читать классическую или научную литературу, стать в газетах и журналах или даже текстовые посты в социальных сетях. Что бы вы ни читали – это поможет вам в подготовке к IELTS.

Пишите осмысленные тексты на английском
Для начала изучите примеры эссе и статей, отметьте их структуру, речевые обороты и лексику. Затем начните сами писать как можно больше текстов-описаний и эссе. Будет здорово, если вы найдете преподавателя или носителя английского, который мог бы проверять ваши тексты.

Проходите пробные IELTS
Любой, кто сдавал IELTS, скажет вам, что для прохождения теста недостаточно просто хорошо знать английский. Необходимо полностью понимать структуру экзамена, тайминг и быть готовым ко всем типам заданий, которые могут вам встретиться'''


SAT_ABOUT_STR = '''
SAT Reasoning Test — стандартизованный тест для приема в высшие учебные заведения в США.'''

SAT_STRUCTURE_STR = '''
Digital SAT - это компьютерный экзамен, который состоит из следующих разделов:

1. Раздел чтения и понимания текстов(Verbal) - в этом разделе тестируются навыки чтения и понимания информации. Вопросы могут быть о теме, цели и содержании текста.

2. Раздел математики - в этом разделе проверяются знания и навыки в области алгебры, геометрии и статистики.

Общее время на выполнение экзамена Digital SAT составляет 3 часа без учета времени на перерывы между разделами. Результаты экзамена будут доступны в течение двух недель после его прохождения.'''

SAT_TIPS_STR = '''
Некоторые советы по подготовке

Начните с изучения официальных материалов College Board на его сайте, просмотрев и найдя полные тесты в Bluebook в разделе Практические тесты.

Также попробуйте бесплатную версию нового экзамена, предоставляемого Khan Academy, которая является официальным спонсором и партнером College Board. Помимо пробных тестов, Khan Academy предлагает множество материалов (тексты, часто задаваемые вопросы, видео), объясняющих разные нюансы SAT.

Другие уважаемые и признанные материалы для подготовки к экзаменам (Barron’s McGraw-Hill Education, Kaplan’s, Kalli’s, Official Guide Official SAT Study Guide SAT 2023) доступны в формате электронной книги (например, приложение Amazon Kindle) на некоторых торговых площадках, сайтах.

Также не спешите выбрасывать старые учебники SAT, так как они все еще действительны для некоторых практических вопросов, типы которых не были изменены.

И, конечно же, продолжайте читать и слушать СМИ на английском языке, чтобы быть в курсе ключевых мировых событий, социально-экономических ситуаций, проблем, стоящих перед человечеством.

Расширяйте кругозор, расширяйте словарный запас, то есть постоянно развивайте свою эрудицию.'''

SAT_SOURCES_STR = '''
Материалы для самоподготовки к SAT:

1)Collegeboard - Официальный сайт организатора экзамена SAT
https://satsuite.collegeboard.org/sat

2)Majortests - Ресурс предлагает 50 бесплатных онлайн-тестов по всем разделам экзамена SAT
http://www.majortests.com/sat/

3)Khanacademy - Основной ресурс для подготовки к экзамену, согласованный с College Board
https://www.khanacademy.org/sat/

4)Sat-subject - Ресурс позволяет пройти онлайн предметные тесты SAT по различным дисциплинам
https://collegereadiness.collegeboard.org/sat-subject-tests/

5)Cracksat - Практические примеры заданий общего и предметных тестов SAT
http://www.cracksat.net/'''

MESK_GRADE_10_SUBJECTS_STR = '''
Предметы:

1. Казахский язык (Я1, Я2)
2. Русский язык (Я1, Я2)
3. История Казахстана
4. Математика
5. Предмет по выбору х1 (физика, информатика, химия, биология)'''

MESK_GRADE_10_SOURCES_STR= '''Материалы:

◉https://drive.google.com/drive/folders/1Q5Ix8ae5ua2HC9MeQSAKvARadgVoKnSj

◉https://drive.google.com/drive/u/0/folders/1-BQ1P5K8e_-5y4nczBMGod0QuSYrBAno

◉https://drive.google.com/drive/folders/1ilyPGBbIevaOXCc4KV8gltiLSQFOiNW7

◉https://mailnisedu-my.sharepoint.com/personal/anapiyaev_n_fmsh_nis_edu_kz/_layouts/15/onedrive.aspx?ga=1&id=%2Fpersonal%2Fanapiyaev%5Fn%5Ffmsh%5Fnis%5Fedu%5Fkz%2FDocuments%2F%D0%9C%D0%AD%D0%A1%D0%9A%2F10%20%D0%A1%D1%8B%D0%BD%D1%8B%D0%BF'''

MESK_GRADE_11_SUBJECTS_STR = '''Предметы:

◉Русский язык (Я2)
◉Казахский язык (Я2)'''

MESK_GRADE_11_SOURCES_STR = '''Материалы:

◉https://drive.google.com/drive/folders/1bDFbIAgcbXS-JCRSdicEySIyMyf8wL57?usp=sharing'''

MESK_GRADE_12_SUBJECTS_STR = '''Предметы:

1. Казахский язык (Я1)
2. Русский язык (Я1)
3. КСМ
4. Математика
5. Предмет по выбору х2 (physics, computer science, biology, chemistry)
6. Доп. предметы х1 (география, графика и проектирование)'''

MESK_GRADE_12_SOURCES_STR = '''
Материалы:

◉https://drive.google.com/drive/u/0/folders/1CDV_-nlf1IHNmju3UMt5B5Bzp8NOCg-0

◉https://drive.google.com/drive/folders/11yWtiPOCCC9-d56ri4ajXZ18SuZPtyhG?usp=sharing

◉https://mailnisedu-my.sharepoint.com/personal/anapiyaev_n_fmsh_nis_edu_kz/_layouts/15/onedrive.aspx?ga=1&id=%2Fpersonal%2Fanapiyaev%5Fn%5Ffmsh%5Fnis%5Fedu%5Fkz%2FDocuments%2F%D0%9C%D0%AD%D0%A1%D0%9A%2F10%20%D0%A1%D1%8B%D0%BD%D1%8B%D0%BF'''

MESK_GRADE_10_ABOUT_STR = '''
<b>МЭСК - это международный экзамен Совета Кэмбридж, который сдают выпускники НИШ.</b>'''
MESK_GRADE_11_ABOUT_STR = '''
<b>МЭСК - это международный экзамен Совета Кэмбридж, который сдают выпускники НИШ.</b>'''
MESK_GRADE_12_ABOUT_STR = '''
<b>МЭСК - это международный экзамен Совета Кэмбридж, который сдают выпускники НИШ.</b>'''

STRANA_PROGRAMMA = '''
<b>Для начала вам необходимо выбрать страну, город обучения, специализацию и вуз. При этом обратите внимание на этих факторов.

Стоимость обучения и проживания
Нужно закладывать минимум ту сумму, наличие которой необходимо подтвердить для оформления студенческой визы. Она варьируется от 8 до 60 тысяч долларов.

Язык обучения
Самые дорогие страны — англоязычные. Но есть более дешевые англоязычные программы в бюджетных странах Прибалтики и Восточной Европы. Также в некоторых странах можно учиться бесплатно на национальном языке.

Требуемое образование
Не во все страны можно поступить на бакалавриат, имея за плечами 11 лет школы в России или СНГ.

Рейтинги вузов
Для первичного поиска можно использовать рейтинги вузов по интересующей вас специальности. Общие рейтинги не отражают полной картины.

Минимальные требования
Чтобы оценить свои шансы, необходимо ориентироваться на результаты реально поступивших в прошлом году студентов.

Содержание программы
Университеты часто предлагают программы с одинаковым названием, но на деле их содержание разнится.

Другие факторы
Местность, климат, наличие языковых курсов, преподавтельский состав, стажировки
</b>'''

FINANCES = '''
<b>В первую очередь подберите программы по своему бюджету, а уже потом проверяйте доступные стипендии на официальных сайтах вузов и подавайте заявки на грантовые и стипендиальные программы сторонних организаций.
Подробнее на сайте: 

◉https://www.unipage.net/ru/admission_university_abroad?ysclid=lij1lutj4r921523455

◉https://www.unipage.net/ru/admission_university_abroad?ysclid=lij1lutj4r921523455#%D0%A8%D0%B0%D0%B3_3_%D0%9E%D0%BF%D1%80%D0%B5%D0%B4%D0%B5%D0%BB%D1%8F%D0%B5%D0%BC%D1%81%D1%8F_%D1%81_%D1%84%D0%B8%D0%BD%D0%B0%D0%BD%D1%81%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5%D0%BC
</b>'''

DOCUMENTS = '''
<b>Сроки подачи разнятся в зависимости от учебного заведения, страны. Подавать заявку лучше как можно раньше — в идеале на 3-4 день после начала. Вам нужны следующие документы для отправки:
</b>'''

STRATEGIES = '''
<b>Стратегии подачи документов:

◉https://informburo.kz/stati/besplatnoe-obrazovanie-za-rubezom-kuda-cashhe-vsego-uezzayut-kazaxstancy?ysclid=lijtyojgdc949604290

◉https://trends.rbc.ru/trends/education/5fc4bd219a7947004a9711c3

В этом документе вы можете найти процедуры подачи: 

◉https://drive.google.com/file/d/13T6eckDCfwHhAh0f2UIUZouDrZsIm_re/view?usp=sharing
</b>'''

EXPECT = '''
<b>В течение нескольких недель письмо придет на электронную или на обычную почту. Могут прислать уведомление о зачислении, уведомление об условном зачислении или отказ.

Подробнее: 

◉https://skillbox.ru/media/education/stalo-izvestno-naskolko-ozhidaniya-ot-obucheniya-v-vuzakh-raskhodyatsya-s-realnostyu/?ysclid=liju2uogf8108401536
</b>'''

IMPORTANT = '''
<b>Важно:

Как можно справиться с разными проектами в вузе: 

◉https://www.youtube.com/watch?v=cNNx3VvA_U8

Действующие советы про трудустройство за границей: 

◉https://habr.com/ru/companies/ibs/articles/302930/</b>'''



MOTIVATIONAL_LETTER = '''
<b>Для мотивационного письма нужно чётко сформулировать, чего абитуриент хочет достичь в жизни и как в этом поможет образование. Приёмная комиссия ценит, когда у поступающего есть чёткий план и траектория профессионального роста.

Вот здесь 500+ образцов мотивационного эссе, которые часто привлекают внимание приемной комиссии: 

◉https://universitycompare.com/personal-statement-examples

А также здесь вы можете найти действующие советы при написании эссе:

◉https://drive.google.com/file/d/13jy1XWgPiuwV1IiKQeLgUmFjkBlfn9xa/view?usp=sharing
{}
</b>'''

RECOMENDATIONAL_LETTER = '''
<b>Рекомендательные письма – это образец письма поддержки, которое доказывает заслуги человека. Рекомендательное письмо или рекомендательное письмо обычно пишется руководителем, работодателем, учителем или консультантом, объясняющим право кандидата, претендующего на новую работу или поступление в школу или колледж. Этот документ добавляет дополнительный вес в заявке на поступление или работу.

Вот здесь несколько примеров хорошего рекомендательного письма:

◉https://bestlettertemplate.com/recommendation-letter-sample-example/

Методы написания рекомендательного письма для учеников:

◉https://www.tuko.co.ke/276556-how-write-a-recommendation-letter-format-practices.html
</b>'''

DIPLOMA_TRANSLATION = '''
<b>Один из важных этапов поступления за границу — перевод документов об образовании. У этой процедуры много нюансов. Рассказываем главное о переводе диплома и аттестата.

Для чего нужно переводить дипломы: 

◉https://www.unipage.net/ru/diploma_translation?ysclid=lijt7mdtad667516573

Как перевести дипломы: 

◉https://zaochnik.ru/blog/kak-perevesti-diplom-na-anglijskij-jazyk-obrazets/?ysclid=lijt7ououa656277771
</b>'''

ACADEMIC_RESUME = '''
<b>Большинство резюме в целом, включая резюме колледжа, будут включать заголовок с такой информацией, как ваш адрес электронной почты, номер телефона, возможно, ваши ссылки в социальных сетях и, возможно, даже ваше имя в Skype. Это основные вещи, которые вы должны иметь в своем заголовке.

Подробнее: 

◉https://medium.com/@philipchesney/college-resume-examples-structure-templates-walk-through-video-f3bc3d45e2fc
</b>'''


COMMON_APP = '''
<b>Свяжитесь со всем, что вам нужно, чтобы подать заявление в колледж, изучить финансовую помощь и стипендии, а также получить совет от консультантов, советников и наставников.

Сайт для заполнения CommonApp: 

◉https://www.commonapp.org/

Как нужно правильно заполнить: 

◉https://www.youtube.com/watch?v=3wqdPM7-yIE

Рекомендации 

◉https://study-america.org/bazaznaniy/zapolnenie-common-application?ysclid=lijtua5s3a523987742
</b>'''

CSS_PROFILE = '''
<b>Профиль CSS — это онлайн-приложение, используемое колледжами и стипендиальными программами для предоставления нефедеральной институциональной помощи.

Сайт для заполнения профиля: 

◉https://cssprofile.collegeboard.org/

Про этот профиль 

◉https://cssprofile.collegeboard.org/about

Как заполнять: 

◉https://www.youtube.com/watch?v=YIoKLjzdgBo
</b>'''

DOCUM_TEXT = '''
<b>Начать подготовку к поступлению в зарубежный вуз необходимо как минимум за год до планируемого срока начала обучения. Это обусловлено ранними сроками подачи пакета документов в университет по определенным бюрократическим процедурам самого образовательного учреждения.
</b>'''

TARBIE = '''
<b>
Тәрбие жұмысының мақсаттары:</b>
Тәрбие жұмысының жүйесі өз Отанына қалтқысыз берілген, жоғары мәдениет пен азаматтық жауапкершілікті меңгерген, үнемі өзгермелі заманда табысты болуға қабілетті және бәсекелі ортада әрекет жасай алатын, шығармашыл әрі жоғары адамгершілікті тұлғаны қалыптастыруға бағытталған.

<b>Тәрбие жұмысының міндеттері:</b>
-	оқушыларды тәрбиелеу үшін оқушылардың, педагогикалық ұжымның, ата-аналар мен жергілікті қоғамдық қауымдастықтың күштерін біріктіру;
-	сабақ беру, қосымша сабақ беру, сыныптан тыс жұмыстар мен жергілікті қауымдастықтың кей мәселелерді шешуге қатысуы арқылы оқушының өмірлік құзіреттіліктерін дамтуды қамтамасыз ету.

<b>Мектептің тәрбие жұмысындағы іс-шаралар жүйенің жүзеге асуын қамтамасыз етеді:</b>
-	Қазақстан Республикасы көпұлтты мәдени мұраларының дамуы мен сақталуын;
-	оқушылардың мәдени және рухани әлеуетін қолдауға, жастар шығармашылығын дамытуға ықпал ету;
-	іс-шараларды бірлесе ұйымдастыру жолымен әлеуметтік серіктестікті дамыту;
-	жағымды ұлтаралық қарым-қатынасты қалыптастыру, ұлтшылдық пен экстремизмнің алдын алу.

<b>Оқу-тәрбие жұмысындағы басым бағыттың бірі:</b>
-      мәдениетаралық қатынас, 
-      толеранттық және жаһандық ойлау  дағдыларының қалыптасуы.

Мектеп құндылықтары біздің түлектеріміздің бойында жалпы адами және ұлттық құндылықтарды жинақтап, кез келген өмірлік  жағдайларда функционалдық сауаттылық пен бәсекеге қабілеттілігін көрсете алады. 

<b>Мектеп нәтижесінде мыналарды тәрбиелеуге ұмтылады:</b>
-	қоғамның, елдің, оны қоршаған адамдардың өмірін жақсартуға белсенді араласатын патриотты;
-	адами және рухани құндылықтарды сіңірген жоғары адамгершілікті меңгерген тұлғаны;
-	көпұлтты және көпмәдениетті ортада белсенді және тиімді өмір сүруге қабілетті, басқалардың мәдениетіне құрметпен, терең түсіністік сезіммен қарайтын, әртүрлі ұлттармен бейбіт және тату тұра алатын тұлғаны –  әлем азаматын.

<b>Тәрбие жүйесі төмендегідей бағытта жүзеге асырылады:</b>
•	Патриоттық тәрбие;
•	Зияткерлік даму;
•	Рухани-адамгершілік тәрбие;
•	Отбасылық, еңбек және экологиялық тәрбие;
•	Денешынықтыру тәрбиесі, салауатты өмір сүруді қалыптастыру;
•	Көпмәдениеттілікті  дамыту және көркемдік-эстетикалық тәрбие;
•	Көшбасшылық қасиеттерді дамыту және ақпараттық мәдениетті тәрбиелеу.

<b>Нәтиже:</b>
2021 – 2022 оқу жылына арналған тәрбие жұмысының  жоспары  Қазақстан Республикасының Конституциясы, «Қазақстан Республикасындағы балалар құқықтары»,    Қазақстан Республикасының «Білім» туралы Заңы,  «Қазақстан Республикасы Үздіксіз  Білім беру  жүйесіндегі тәрбие Тұжырымдамасы», Назарбаев Зияткерлік мектептеріндегі білім беру үдерісін ұйымдастырудың оқу-нормативтік негіздері,  «Назарбаев Зияткерлік мектептері дербес білім беру ұйымының 2030 жылға дейінгі даму стратегиясы»,  «НЗМ оқушыларын қорғау саясаты», «ЗСЭН сясаты»,  Елбасының «Мәңгілік ел» ұлттық идеясы мен  «Болашаққа бағдар: Рухани жаңғыру», «Ұлы даланың жеті қыры»  бағдарламалық мақалаларының  негізінде құрылды.
'''


callback_functions_dict = {
    
    'tarbie': TARBIE,
    'mission':SCHOOL_MISSION,
    'values': SCHOOL_VALUES,
    'ielts_structure':IELTS_STRUCTURE_STR,
    'ielts_tips': IELTS_TIPS_STR,
    'sat_structure':SAT_STRUCTURE_STR,
    'sat_tips':SAT_TIPS_STR,
    'sat_sources':SAT_SOURCES_STR,
    'mesk_grade_10_subjects': MESK_GRADE_10_SUBJECTS_STR,
    'mesk_grade_10_sources': MESK_GRADE_10_SOURCES_STR,
    'mesk_grade_11_subjects': MESK_GRADE_11_SUBJECTS_STR,
    'mesk_grade_11_sources': MESK_GRADE_11_SOURCES_STR,
    'mesk_grade_12_subjects': MESK_GRADE_12_SUBJECTS_STR,
    'mesk_grade_12_sources': MESK_GRADE_12_SOURCES_STR,
    'strana_programma': STRANA_PROGRAMMA,
    'finances':FINANCES,
    'documents':DOCUMENTS,
    'strategies':STRATEGIES,
    'expect':EXPECT,
    'important':IMPORTANT,
    'motivational_letter':MOTIVATIONAL_LETTER,
    'recomendational_letter':RECOMENDATIONAL_LETTER,
    'diploma_translation':DIPLOMA_TRANSLATION,
    'academic_resume':ACADEMIC_RESUME,
    'common_app':COMMON_APP,
    'css_profile':CSS_PROFILE,
}